[
  {
    "ID": "01_gorgias_app",
    "title": "Gorgias app helpdesk SAS - UI/UX",
    "coverImg": "/images/gorgias.svg",
    "date": "Nov / 2021",
    "client": "Gorgias",
    "embed": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2Fxajn9H0Vx7rd5qx4NfDUTN%2FPortfolio%3Fnode-id%3D103%253A8851%26t%3D1SnWzHuhqpBDe5LP-1",
    "tags": ["UX", "UI", "Design", "Systems", "Prototype", "Testing"],
    "intro": "Gorgias is a <b>San-Francisco-based company</b> focused on providing the best helpdesk product out there. It introduces some unique features to help agents treat support requests more effectively; configure automatic responses, flawlessly integrations with social media channels, and most popular platforms in the e-commerce ecosystem.",
    "details": "For the past 3 years, I have worked regularly with Gorias on multiple fronts. We started with rebranding and moved on to redesigning the product. In the design process, I gathered app usage data, made hypotheses, produced prototypes, looked at client feedback, and validated my design choices with the cofounders, respectively the CTO and CEO. I made a thoroughly documented design system to enable collaboration and scale within the product team. During the implementation phase, I was actively involved in the GitHub workflow to respond to devs requests. I have designed the native app and the chat widget used on the customer`s e-commerce websites. I have gradually implemented workflows and processes to speed up production and make a more customer-centric product.\nThe redesign solved all the usability issues. Clients loved it from day one. 90% of the feedback was positive. In the following months, the company had spectacular growth. It went from 5 to 15 employees, Launched on Shopify, Raised a series A of 14M, extended in Europe, Launched on Magento, raised 25M series B, expanded to 70+ employees, and served more than 4000 customers.\nI have greatly evolved professionally working within the Gorgias product team. I learned to work in short feedback loops and involve the people who knew best the specific issues I was trying to solve. I got better at taking and giving feedback. I learned how to create design systems that scale. I have gained extended experience in the E-commerce ecosystem, customers, Shopify, and a plethora of other services that we used for integrations.",
    "tasks": [
      "create this and that from scratch when there was nothing",
      "create this and that from scratch when there was nothing",
      "create this and that from scratch when there was nothing"
    ],
    "role": "Product Designer",
    "images": [
      {
        "url": "https://drive.google.com/uc?id=1x8BrkkNiNKFphjEXg8rK8LvoIBoiJjoB&export=download",
        "text": "something"
      },
      {
        "url": "https://drive.google.com/uc?id=1x8BrkkNiNKFphjEXg8rK8LvoIBoiJjoB&export=download",
        "text": "something"
      },
      {
        "url": "https://drive.google.com/uc?id=1x8BrkkNiNKFphjEXg8rK8LvoIBoiJjoB&export=download",
        "text": "something"
      }
    ]
  }
]
